Tekla.Structures.CatalogInternal.dotcatShapeImport_t
The import shape struct internally used to communicate with TS.

Tekla.Structures.CatalogInternal.dotcatShapeImport_t.EntryType
Type of entry.

Tekla.Structures.CatalogInternal.dotcatShapeImport_t.FolderPath
The folder path.

Tekla.Structures.CatalogInternal.dotcatShapeImport_t.EntryFileName
The entry file name.

Tekla.Structures.CatalogInternal.dotcatShapeImport_t.ShapeName
The shape name.

Tekla.Structures.CatalogInternal.dotcatShapeImport_t.GeometryIdentifier
The name.

Tekla.Structures.CatalogInternal.dotcatShapeImport_t.Fingerprint
The shape geometric fingerprint.

Tekla.Structures.CatalogInternal.dotcatShapeImport_t.CoordinateSystem
Gets or sets the coordinate system.

Tekla.Structures.CatalogInternal.dotcatShapeImport_t.CreateCustomPart
A flag indicating if a custom part is to be created at import

Tekla.Structures.CatalogInternal.dotcatShapeImport_t.Overwrite
Existing shape will be overwritten if value is not zero.

Tekla.Structures.CatalogInternal.dotcatShapeImport_t.ScalingFactor
The scaling factor